export const codepathTree = [
    {
        name: "نیرو زمینی ارتش جمهوری اسلامی",
        value: "001",
        subpaths: [
            {
                name: "آموزشی ۰۱",
                value: "00101",
                subpaths: [
                    {
                        name: "بخش اداری",
                        value: "0010101",
                        subpaths: []
                    },
                    {
                        name: "بخش حقوقی",
                        value: "0010202",
                        subpaths: []
                    }
                ]
            },
            {
                name: "پایگاه ۰۲",
                value: "00102",
                subpaths: []
            },
            {
                name: "پایگاه ۰۳",
                value: "00103",
                subpaths: []
            },
            {
                name: "پایگاه ۰۴",
                value: "00104",
                subpaths: []
            }
        ]
    },
    {
        name: "نیرو هوایی ارتش جمهوری اسلامی",
        value: "002",
        subpaths: [
            {
                name: "ستاد نهاجا",
                value: "00201",
                subpaths: []
            },
            {
                name: "فرماندهی آموزش های هوایی شهید خضرایی",
                value: "00202",
                subpaths: []
            },
            {
                name: "پایگاه یکم شکاری فرودگاه مهرآباد",
                value: "00203",
                subpaths: []
            },
            {
                name: "پایگاه دهم شکاری فرودگاه چابهار-کنارک",
                value: "00204",
                subpaths: []
            }
        ]
    },
    {
        name: "نیرو دریایی ارتش جمهوری اسلامی",
        value: "003",
        subpaths: [
            {
                name: "ستاد نداجا",
                value: "00301",
                subpaths: []
            },
            {
                name: "فرماندهی آموزش های دریایی",
                value: "00302",
                subpaths: []
            },
            {
                name: "پایگاه دریایی کنارک",
                value: "00303",
                subpaths: []
            }
        ]
    },
    {
        name: "نیرو پدافند ارتش جمهوری اسلامی",
        value: "004",
        subpaths: []
    },
]

export const codePathTranslate = new Map<string, string>([
    ['001', 'نیرو زمینی ارتش جمهوری اسلامی'],
    ["00101", "آموزشی ۰۱"],
    ["0010101", "بخش اداری"],
    ["0010202", "بخش حقوقی"],
    ['002', 'نیرو هوایی ارتش جمهوری اسلامی'],
    ['003', 'نیرو دریایی ارتش جمهوری اسلامی'],
    ['004', 'نیرو پدافند ارتش جمهوری اسلامی'],
    ["00102", "پایگاه ۰۲"],
    ["00103", "پایگاه ۰۳"],
    ["00104", "پایگاه ۰۴"],
    ["00201", "ستاد نهاجا"],
    ["00202", "فرماندهی آموزش های هوایی شهید خضرایی"],
    ["00203", "پایگاه یکم شکاری فرودگاه مهرآباد"],
    ["00204", "پایگاه دهم شکاری فرودگاه چابهار-کنارک"],
    ["00301", "ستاد نداجا"],
    ["00302", "فرماندهی آموزش های دریایی"],
    ["00303", "پایگاه دریایی کنارک"],
    
]);